In [9]:
import os
import numpy as np
from env import user, password, host
import pandas as pd
import matplotlib as plt
import seaborn as  sb
import scipy.stats as stats
from pydataset import data

In [10]:

# Exercise 4: 
# In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing
# datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

df_iris = data('iris')

In [11]:
# Exercise 4.1: Print the first 3 rows

df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [18]:
# Exercise 4.2: Print the column names

list(df_iris)

['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width', 'Species']

In [24]:
# Exercise 4.3: Print the data type of each column

df_iris.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

In [25]:
# Exercise 4.4: Print the summary statistics for each of the numeric variables

df_iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [30]:
# Exercise 5:

# Read the data from this google sheet into a dataframe, df_google.

gsheet= 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'
csv_export_url = gsheet.replace('/edit#gid=', '/export?format=csv&gid=')

df_google= pd.read_csv(csv_export_url)

In [31]:
# Exercise 5.1: Print the first three rows

df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [32]:
# Exercise 5.2: Print the number of rows and columns

df_google.shape

(891, 12)

In [38]:
# Exercise 5.3: Print the column names 

glist = list(df_google)
glist

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [34]:
# Exercise 5.4: Print the data type of each column

df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [35]:
# Exercise 5.5: Print the summary statistics for each of the numeric variables

df_google.describe().T

,count,mean,std,min,25%,50%,75%,max
PassengerId,891.0,446.000000,257.353842,1.00,223.5000,446.0000,668.5,891.0000
Survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.0000
Pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
Age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000
SibSp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
Parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
Fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292

In [52]:
# Exercise 5.6: Print the unique values for each of your categorical variables


catgoogle = df_google.select_dtypes('object')
catgoogle.dtypes

Name        object
Sex         object
Ticket      object
Cabin       object
Embarked    object
dtype: object

In [66]:

catgoogle.apply(lambda col: col.nunique())

Name        891
Sex           2
Ticket      681
Cabin       147
Embarked      3
dtype: int64

In [ ]:

# Exercise 6: 
    
# Download the previous exercise's file into an excel (File → Download → Microsoft Excel). Read the downloaded
# file into a dataframe named df_excel.

#     assign the first 100 rows to a new dataframe, df_excel_sample
#     print the number of rows of your original dataframe
#     print the first 5 column names
#     print the column names that have a data type of object
#     compute the range for each of the numeric variables.


df_excel = read_excel()